package HW_5;

/*
    05.12.2022

    1) Создать массивы типа: int, double и создать методы, для их вывода на консоль
    2) Сделать программу, которая будет складывать или вычитать введенные числа многократно,
    пока не будет дана команда на выход из цикла
    3) Сделать процедуру для вывода из массива чисел со значением кратным 3. Найти в другой функции их среднее
    арифметическое значение
    4) Перевернуть массив(реверсировать) и вывести из него все значения на нечетных позициях.
    5**) Создать метод, который будет применять строку и выводить из нее только гласные буквы


 */

public class Main {
}
