package homeWork.HW_7;
/*
    19.12.2022

    1)Создать Scanner и организовать ввод чисел
    2) Проверить больше ли некоторого значения сумма двух чисел, если нет вывести сообщение что сумма меньше заданного значение
    3) Через case обработать несколько вариантов введенной переменной, предусмотреть дефолтный случай
    4) Инициализировать массив псевдослучайными числами(Random)
    5) Найти сумму и произведение всех элементов этого массива
    6) Сделать класс, который будет искать площадь треугольника, прямоугольника и окружности
    7) В классе Human добавить возможность изменения значений
    8) Написать 15 тернарных операторов
    9) Показать работу с методами классов String, StringBuilder и StringBuffer
 */

public class Main {
}
